In [1]:
import pandas as pd

In [2]:
a = pd.Series([1, 2, 4, 5])
a

0    1
1    2
2    4
3    5
dtype: int64

In [3]:
a = pd.Series([1, 2, 4, 5], index = ['a', 'b', 'c', 'd'])
a

a    1
b    2
c    4
d    5
dtype: int64

In [4]:
a.values
a.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
a = pd.Series([1, 2, 4, 5], index = ['a', 'b', 'c', 'd'], name = 'Integer Series')
a

a    1
b    2
c    4
d    5
Name: Integer Series, dtype: int64

In [6]:
a = pd.Series([1, 2, 4, 5], index = ['a', 'b', 'c', 'd'], name = 'Integer Series', dtype = float)
a

a    1.0
b    2.0
c    4.0
d    5.0
Name: Integer Series, dtype: float64

In [7]:
alphabets = []
for i in range(97, 105):
    a = chr(i)
    alphabets.append(a)
alphabets

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [8]:
a = pd.Series(range(97, 105), index = alphabets, name = 'Alphabets ASCII')
a

a     97
b     98
c     99
d    100
e    101
f    102
g    103
h    104
Name: Alphabets ASCII, dtype: int64

In [9]:
b=pd.Series(input("enter your sales per day").split(","), dtype = float)
b

enter your sales per day12,3,25

0    12.0
1     3.0
2    25.0
dtype: float64

In [10]:
a['d']
a[3]

100

In [11]:
a[[0, 2 ]]
a[['a', 'c', 'd' ]]

a     97
c     99
d    100
Name: Alphabets ASCII, dtype: int64

In [12]:
a[a > 100]

e    101
f    102
g    103
h    104
Name: Alphabets ASCII, dtype: int64

In [13]:
a * 2

a    194
b    196
c    198
d    200
e    202
f    204
g    206
h    208
Name: Alphabets ASCII, dtype: int64

In [14]:
c=pd.Series([1,2,3,4],index=["a","b",'c','d'])
c

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
d=pd.Series([5,6,7],index=['a','b','c'])
d

a    5
b    6
c    7
dtype: int64

In [16]:
c+d

a     6.0
b     8.0
c    10.0
d     NaN
dtype: float64

In [17]:
e={"name":"umair","hobey":"football"}
g=pd.Series(e)
g.index

Index(['name', 'hobey'], dtype='object')

In [18]:
import numpy as np
x=np.array([6,7,8])
y=np.array([0,1,1])
z=pd.Series(x,y)
z

0    6
1    7
1    8
dtype: int32

In [19]:
z[1]

1    7
1    8
dtype: int32

In [20]:
w=pd.Series([1,2,3,4],index=['a','b','c','d'])
w

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
x=pd.Series(w,index=['a','b','c','d', 'e'])
x
pd.isnull(x)
x.notnull()
x.isnull()

a    False
b    False
c    False
d    False
e     True
dtype: bool

In [22]:
x.name="integer values"
x.index.name="index name"
x

index name
a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: integer values, dtype: float64

In [23]:
s=pd.Series([1,2,3,4])
t=pd.Series([5,6,7,8])
q={"first":s,"second":t}
u=pd.DataFrame(q)
u

   first  second
0      1       5
1      2       6
2      3       7
3      4       8

In [24]:
fruits=pd.Series([1,2,3,4],['a','b','c','d'])
vegetable=pd.Series([1,2,3,4],['g','h','i','j'])
sabzi={"fruits":fruits,"vegetables":vegetable}
meat=pd.DataFrame(sabzi)
meat

   fruits  vegetables
a     1.0         NaN
b     2.0         NaN
c     3.0         NaN
d     4.0         NaN
g     NaN         1.0
h     NaN         2.0
i     NaN         3.0
j     NaN         4.0

In [25]:
meat.head()

   fruits  vegetables
a     1.0         NaN
b     2.0         NaN
c     3.0         NaN
d     4.0         NaN
g     NaN         1.0

In [26]:
state=pd.Series(["afgan","turkish","azrbaijan"], index = [5, 6, 7])
dit={"states":state,
     "independence_year":[1994,55,666]  
    }
kit=pd.DataFrame(dit,index=[5,6,7])
kit

      states  independence_year
5      afgan               1994
6    turkish                 55
7  azrbaijan                666

In [27]:
t=pd.DataFrame(state,columns=["sargil"])
t

      sargil
5      afgan
6    turkish
7  azrbaijan

In [28]:
state=pd.Series(["afgan","turkish","azrbaijan"])
s=pd.Series(["kana village","rana village","brazil"])
st=pd.Series(["china","india","pakistan"])
t=pd.DataFrame(columns=["sargil","parbil","kargil"])
t['sargil'] = state
t["parbil"]=s
t["kargil"]=st
t

      sargil        parbil    kargil
0      afgan  kana village     china
1    turkish  rana village     india
2  azrbaijan        brazil  pakistan

In [29]:
t['sargil'][1]
t.sargil

0        afgan
1      turkish
2    azrbaijan
Name: sargil, dtype: object

In [30]:
t.iloc[0]

sargil           afgan
parbil    kana village
kargil           china
Name: 0, dtype: object

In [31]:
nm=["nabeel",'sameer','usman','ovais','umair','ovais','sameer']
ids=['a', 'b', 'c', 'd', 'e','f', 'g']
cr=['cs','it','se','qc','ai','qc','iot']
d={"name":nm,"course":cr}
k=pd.DataFrame(d,index=ids)
k.loc[(k['name'] == 'sameer') & (k['course'] == 'iot')]

     name course
g  sameer    iot

In [32]:
j=pd.Series([1,2,3,4])
k=pd.DataFrame(j,columns=['h1'])
k

   h1
0   1
1   2
2   3
3   4

In [33]:
import numpy as np
l=([1,2,3,4])
j=([5,6,7,8])
dic={"lov":l,"jor":j}
x = pd.DataFrame(dic)
x['kor'] = np.nan
x['kor']=5
x

   lov  jor  kor
0    1    5    5
1    2    6    5
2    3    7    5
3    4    8    5

In [34]:
n=pd.Series(["blue","orange","yellow"],index=[0,3,6])
i=pd.DataFrame(n,index=[0,3,6])
i = i.reindex(index = range(0, 9), method = 'ffill')
i

        0
0    blue
1    blue
2    blue
3  orange
4  orange
5  orange
6  yellow
7  yellow
8  yellow

In [35]:
i.ffill()

        0
0    blue
1    blue
2    blue
3  orange
4  orange
5  orange
6  yellow
7  yellow
8  yellow

In [36]:
n=pd.Series(["blue","orange","yellow"],index=[0,3,6])
i=pd.DataFrame(n,index=[0,3,6])
i = i.reindex(index = range(0, 9), method = 'bfill')
i

        0
0    blue
1  orange
2  orange
3  orange
4  yellow
5  yellow
6  yellow
7     NaN
8     NaN

In [37]:
df = pd.DataFrame(np.arange(0, 9).reshape(3, 3), columns = ['a', 'b', 'c'])
df

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [38]:
col = ['a', 'b', 'c', 'd']
df1 = pd.DataFrame(df, columns = col)
df1

   a  b  c   d
0  0  1  2 NaN
1  3  4  5 NaN
2  6  7  8 NaN

In [39]:
df1.ffill(axis = 1)

     a    b    c    d
0  0.0  1.0  2.0  2.0
1  3.0  4.0  5.0  5.0
2  6.0  7.0  8.0  8.0

In [40]:
cl = ['a', 'b', 'c', 'h']
df1.reindex(columns = cl)

   a  b  c   h
0  0  1  2 NaN
1  3  4  5 NaN
2  6  7  8 NaN

In [41]:
df1.drop(0)

   a  b  c   d
1  3  4  5 NaN
2  6  7  8 NaN

In [42]:
df1.drop('d', axis = 1)

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [43]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])
data_df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data_df[2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
data_df['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [46]:
data_df['two'][2:]

Utah         9
New York    13
Name: two, dtype: int32

In [47]:
data_df.one[2:]

Utah         8
New York    12
Name: one, dtype: int32

In [48]:
data_df.two[data_df['two'] > 1]

Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [49]:
data_df.two > 5

Ohio        False
Colorado    False
Utah         True
New York     True
Name: two, dtype: bool

In [50]:
data_df.two[data_df.two > 5]

Utah         9
New York    13
Name: two, dtype: int32

In [51]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])
data_df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data_df.loc[['Colorado', 'Utah'], ['two', 'three']]

          two  three
Colorado    5      6
Utah        9     10

In [53]:
data_df.iloc[1:3, [1, 2]]

          two  three
Colorado    5      6
Utah        9     10

In [54]:
data_df.iloc[ :3 , :3 ]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

In [55]:
data_df.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [56]:
data1 = pd.DataFrame(np.arange(0, 9).reshape(3, 3))
data2 = pd.DataFrame(np.arange(9, 18).reshape(3, 3))
print(data1)
print('\n')
print(data2)
print('\n')
print(data1 + data2)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8


    0   1   2
0   9  10  11
1  12  13  14
2  15  16  17


    0   1   2
0   9  11  13
1  15  17  19
2  21  23  25

In [60]:
data = pd.Series(np.random.randn(8), index = [['a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 1, 2, 1, 2, 1, 2]])
data

a  1   -0.089981
   2   -2.136860
b  1   -1.459892
   2   -0.662791
c  1   -0.125462
   2   -0.087236
d  1   -0.434591
   2   -0.061621
dtype: float64

In [61]:
data['b']

1   -1.459892
2   -0.662791
dtype: float64

In [66]:
data['b'][2]

-0.6627906579357042

In [62]:
data['b':'c']

b  1   -1.459892
   2   -0.662791
c  1   -0.125462
   2   -0.087236
dtype: float64

In [65]:
data.loc['b' : 'c']

b  1   -1.459892
   2   -0.662791
c  1   -0.125462
   2   -0.087236
dtype: float64

In [68]:
data.loc[:, 2]

a   -2.136860
b   -0.662791
c   -0.087236
d   -0.061621
dtype: float64

In [69]:
data[:, 2]

a   -2.136860
b   -0.662791
c   -0.087236
d   -0.061621
dtype: float64

In [72]:
data.loc[['b', 'd']]

b  1   -1.459892
   2   -0.662791
d  1   -0.434591
   2   -0.061621
dtype: float64

In [76]:
df = data.unstack()
display(df)

          1         2
a -0.089981 -2.136860
b -1.459892 -0.662791
c -0.125462 -0.087236
d -0.434591 -0.061621

In [77]:
df.stack()

a  1   -0.089981
   2   -2.136860
b  1   -1.459892
   2   -0.662791
c  1   -0.125462
   2   -0.087236
d  1   -0.434591
   2   -0.061621
dtype: float64

In [80]:
data.unstack().stack()

a  1   -0.089981
   2   -2.136860
b  1   -1.459892
   2   -0.662791
c  1   -0.125462
   2   -0.087236
d  1   -0.434591
   2   -0.061621
dtype: float64

In [85]:
df = pd.DataFrame(np.arange(12).reshape(4, 3), index = [['a', 'a', 'b', 'b'], 
                                                        [1, 1, 2, 2]], columns = [['Pak', 'Aus', 'Ban'], [3 , 4, 5]])
df.index.names = ['k1', 'k2']
df.columns.names = ['state', 'rank']
df

state Pak Aus Ban
rank    3   4   5
k1 k2
a  1    0   1   2
   1    3   4   5
b  2    6   7   8
   2    9  10  11

In [86]:
df.swaplevel('k1', 'k2')

state Pak Aus Ban
rank    3   4   5
k2 k1
1  a    0   1   2
   a    3   4   5
2  b    6   7   8
   b    9  10  11

In [87]:
df.sort_index(level = 1)

state Pak Aus Ban
rank    3   4   5
k1 k2
a  1    0   1   2
   1    3   4   5
b  2    6   7   8
   2    9  10  11

In [88]:
df.swaplevel(0, 1).sort_index(level = 0)

state Pak Aus Ban
rank    3   4   5
k2 k1
1  a    0   1   2
   a    3   4   5
2  b    6   7   8
   b    9  10  11

In [89]:
df.sum()

state  rank
Pak    3       18
Aus    4       22
Ban    5       26
dtype: int64

In [90]:
df.sum(level = 'k1')

state Pak Aus Ban
rank    3   4   5
k1
a       3   5   7
b      15  17  19

In [91]:
df.sum(level = 'k2')

state Pak Aus Ban
rank    3   4   5
k2
1       3   5   7
2      15  17  19

In [94]:
df.sum(level = 'rank', axis = 1)

rank   3   4   5
k1 k2
a  1   0   1   2
   1   3   4   5
b  2   6   7   8
   2   9  10  11

In [95]:
frame = pd.DataFrame({'a': range(7), 
                      'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two', 
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]}
                    )
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [102]:
frame2 = frame.set_index(['c', 'd'])

In [103]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [104]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [105]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [106]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
        'data2': range(3)})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [107]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)} )
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [108]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [109]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0